# Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями).
# Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. n — кол-во элементов первого множества. m — кол-во элементов второго множества. 
# Затем пользователь вводит сами элементы множеств.
  
#n = input (f'Введите первый множетель' , *{})
# m = input (f'Введите второй множетель' , *{})

#n1 = list(n)
# import random
# listn = list()
# for i in range(0, 11):
#         listn.append(random.randit(-11 < 11))
# print(listn)
# listt = list()
# count = 0
# for i in range(len(listn)-1):
#     if listn[i] < listn[i+1]:
#           count += 1
#           listt.append(f'{listn[i]} < {listn[i+1]}')
# print(f'{count} {listt}')
#n1.sort()
# m = list(m)
#print(n1)
#print(type(n1))
# print(m) 
