#Задача 2: Найдите сумму цифр трехзначного числа.

#*Пример:*

#123 -> 6 (1 + 2 + 3)
#100 -> 1 (1 + 0 + 0) |
n1 = 1;n2 = 2 ;n3 = 3 ;
n =n1 + n2 + n3
print('Средняя сумма 123 -', n)

nq = 1;nw = 0 ;ne = 0 ;
na =nq + nw + ne
print('Средняя сумма 100 -', na)
